Revit 2027 API
BuiltInFailures.SketchFailures.RebarEmptySketchError Property
 Rebar Sketch is empty. Can't create Rebar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarEmptySketchError { get; }
Public Shared ReadOnly Property RebarEmptySketchError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarEmptySketchError {
	FailureDefinitionId^ get ();
}
static member RebarEmptySketchError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace